ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/ADC_ADC_CFG_502C0000h.xml
	<bitfield id="PPB1ZERO" width="1" begin="2" end="2" resetval="0x0" description="Post Processing Block 1 Zero Crossing Event Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="2" rwaccess="R/W"/>
	<bitfield id="PPB1TRIPLO" width="1" begin="1" end="1" resetval="0x0" description="Post Processing Block 1 Trip Low Event Enable. Setting this bit allows the corresponding rising trip low flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="1" rwaccess="R/W"/>
	<bitfield id="PPB1TRIPHI" width="1" begin="0" end="0" resetval="0x0" description="Post Processing Block 1 Trip High Event Enable. Setting this bit allows the corresponding rising trip high flag to activate the event signal to the PWM blocks. The flag must be cleared before it can produce additional events to the PWM blocks." range="0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCEVTINTSEL" acronym="ADC_CFG_ADCEVTINTSEL" offset="108" width="16" description="ADC Event Interrupt Selection Register.">
		<bitfield id="PPB4ZERO" width="1" begin="14" end="14" resetval="0x0" description="Post Processing Block 4 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="14" rwaccess="R/W"/>
	<bitfield id="PPB4TRIPLO" width="1" begin="13" end="13" resetval="0x0" description="Post Processing Block 4 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="13" rwaccess="R/W"/>
	<bitfield id="PPB4TRIPHI" width="1" begin="12" end="12" resetval="0x0" description="Post Processing Block 4 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="12" rwaccess="R/W"/>
	<bitfield id="PPB3ZERO" width="1" begin="10" end="10" resetval="0x0" description="Post Processing Block 3 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="10" rwaccess="R/W"/>
	<bitfield id="PPB3TRIPLO" width="1" begin="9" end="9" resetval="0x0" description="Post Processing Block 3 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="9" rwaccess="R/W"/>
	<bitfield id="PPB3TRIPHI" width="1" begin="8" end="8" resetval="0x0" description="Post Processing Block 3 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="8" rwaccess="R/W"/>
	<bitfield id="PPB2ZERO" width="1" begin="6" end="6" resetval="0x0" description="Post Processing Block 2 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="6" rwaccess="R/W"/>
	<bitfield id="PPB2TRIPLO" width="1" begin="5" end="5" resetval="0x0" description="Post Processing Block 2 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="5" rwaccess="R/W"/>
	<bitfield id="PPB2TRIPHI" width="1" begin="4" end="4" resetval="0x0" description="Post Processing Block 2 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="4" rwaccess="R/W"/>
	<bitfield id="PPB1ZERO" width="1" begin="2" end="2" resetval="0x0" description="Post Processing Block 1 Zero Crossing Interrupt Enable. Setting this bit allows the corresponding rising zero crossing flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="2" rwaccess="R/W"/>
	<bitfield id="PPB1TRIPLO" width="1" begin="1" end="1" resetval="0x0" description="Post Processing Block 1 Trip Low Interrupt Enable. Setting this bit allows the corresponding rising trip low flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="1" rwaccess="R/W"/>
	<bitfield id="PPB1TRIPHI" width="1" begin="0" end="0" resetval="0x0" description="Post Processing Block 1 Trip High Interrupt Enable. Setting this bit allows the corresponding rising trip high flag to activate the event interrupt signal to the PIE. The flag must be cleared before it can produce additional interrupts to the PIE." range="0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCCOUNTER" acronym="ADC_CFG_ADCCOUNTER" offset="114" width="16" description="ADC Counter Register.">
		<bitfield id="FREECOUNT" width="12" begin="11" end="0" resetval="0x0" description="ADC Free Running Counter Value. This bit field reflects the status of the free running ADC counter." range="11:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCREV" acronym="ADC_CFG_ADCREV" offset="116" width="16" description="ADC Revision Register.">
		<bitfield id="REV" width="8" begin="15" end="8" resetval="0x1" description="ADC Revision. To allow documentation of differences between revisions. First version is labeled as00h" range="15:8" rwaccess="R"/>
	<bitfield id="TYPE" width="8" begin="7" end="0" resetval="0x5" description="ADC Type. Always set to 5 for this ADC." range="7:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB1CONFIG" acronym="ADC_CFG_ADCPPB1CONFIG" offset="128" width="16" description="ADC PPB1 Config Register.">
		<bitfield id="ABSEN" width="1" begin="6" end="6" resetval="0x0" description="ADC Post Processing Block 1 Absolute Value Enable. When set this bit enables absolute value calculation on the ADCRESULx associated with ADCPPB1. This occurs before the TWOSCOMPEN logic is evaluated [so enabling both TWOSCOMPEN and ABSEN will always result in a negative value stored in ADCPPBxRESULT]   0  ADCPPB1RESULT = ADCRESULTx - ADCPPB1OFFREF   1  ADCPPB1RESULT = abs[ADCRESULTx - ADCPPB1OFFREF]" range="6" rwaccess="R/W"/>
	<bitfield id="CBCEN" width="1" begin="5" end="5" resetval="0x0" description="ADC Post Processing Block Cycle By Cycle Enable. When set, this bit enables the post conversion hardware processing circuit to automatically clear the ADCEVTSTAT on a conversion if the event condition is no longer present." range="5" rwaccess="R/W"/>
	<bitfield id="TWOSCOMPEN" width="1" begin="4" end="4" resetval="0x0" description="ADC Post Processing Block 1 Two's Complement Enable. When set this bit enables the post conversion hardware processing circuit that performs a two's complement on the output of the offset/reference subtraction unit before storing the result in the  ADCPPB1RESULT register.   0  ADCPPB1RESULT = ADCRESULTx - ADCPPB1OFFREF   1  ADCPPB1RESULT = ADCPPB1OFFREF - ADCRESULTx" range="4" rwaccess="R/W"/>
	<bitfield id="CONFIG" width="4" begin="3" end="0" resetval="0x0" description="ADC Post Processing Block 1 Configuration. This bit field defines which SOC/EOC/RESULT is associated with this post processing block.  0000 SOC0/EOC0/RESULT0 is associated with post processing block 1  0001 SOC1/EOC1/RESULT1 is associated with post processing block 1  0010 SOC2/EOC2/RESULT2 is associated with post processing block 1  0011 SOC3/EOC3/RESULT3 is associated with post processing block 1  0100 SOC4/EOC4/RESULT4 is associated with post processing block 1  0101 SOC5/EOC5/RESULT5 is associated with post processing block 1  0110 SOC6/EOC6/RESULT6 is associated with post processing block 1  0111 SOC7/EOC7/RESULT7 is associated with post processing block 1  1000 SOC8/EOC8/RESULT8 is associated with post processing block 1  1001 SOC9/EOC9/RESULT9 is associated with post processing block 1  1010 SOC10/EOC10/RESULT10 is associated with post processing block 1  1011 SOC11/EOC11/RESULT11 is associated with post processing block 1  1100 SOC12/EOC12/RESULT12 is associated with post processing block 1  1101 SOC13/EOC13/RESULT13 is associated with post processing block 1  1110 SOC14/EOC14/RESULT14 is associated with post processing block 1  1111 SOC15/EOC15/RESULT15 is associated with post processing block 1" range="3:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB1STAMP" acronym="ADC_CFG_ADCPPB1STAMP" offset="130" width="16" description="ADC PPB1 Sample Delay Time Stamp Register.">
		<bitfield id="DLYSTAMP" width="12" begin="11" end="0" resetval="0x0" description="ADC Post Processing Block 1 Delay Time Stamp. When an SOC starts sampling the value contained in REQSTAMP is subtracted from the value in ADCCOUNTER.FREECOUNT and loaded into this bit field, thereby giving the number of system clock cycles delay between the SOC trigger and the actual start of the sample." range="11:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB1OFFCAL" acronym="ADC_CFG_ADCPPB1OFFCAL" offset="132" width="16" description="ADC PPB1 Offset Calibration Register.">
		<bitfield id="OFFCAL" width="10" begin="9" end="0" resetval="0x0" description="ADC Post Processing Block 1 Offset Correction. This bit field can be used to digitally remove any system level offset inherent in the ADCIN circuit. This 10-bit signed value is subtracted from the ADC output before being stored in the ADCRESULT register.  000h No change. The ADC output is stored directly into ADCRESULT.  001h ADC output - 1 is stored into ADCRESULT.  002h ADC output - 2 is stored into ADCRESULT.   ...  200h ADC output + 512 is stored into ADCRESULT.   ...   3FFh  ADC output + 1 is stored into ADCRESULT. NOTE: In 16-bit mode, the subtraction will saturate at0000hand FFFFh before being stored into the ADCRESULT register. In 12-bit mode, the subtraction will saturate at0000hand 0FFFh before being stored into the ADCRESULT register. Note: in the case that multiple PPBs point to the same SOC, only the OFFCAL of the lowest numbered PPB will be applied.  " range="9:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB1OFFREF" acronym="ADC_CFG_ADCPPB1OFFREF" offset="134" width="16" description="ADC PPB1 Offset Reference Register.">
		<bitfield id="OFFREF" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block 1 Offset Correction. This bit field can be used to either calculate the feedback error or convert a unipolar signal to bipolar by subtracting a reference value. This 16-bit unsigned value is subtracted from the ADCRESULT register before being passed through an optional two's complement function and stored in the ADCPPB1RESULT register. This subtraction is not saturated.  0000h No change. The ADCRESULT value is passed on.  0001h ADCRESULT - 1 is passed on.  0002h ADCRESULT - 2 is passed on.   ...  8000h ADCRESULT - 32,768 is passed on.   ...   FFFFh  ADCRESULT - 65,535 is passed on. NOTE: In 12-bit mode the size of this register does not change from 16-bits. It is the user's responsibility to ensure that only a 12-bit value is written to this register when in 12-bit mode." range="15:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB1TRIPHI" acronym="ADC_CFG_ADCPPB1TRIPHI" offset="136" width="32" description="ADC PPB1 Trip High Register.">
		<bitfield id="LIMITHI" width="24" begin="23" end="0" resetval="0x0" description="ADC Post Processing Block 1 Trip High Limit. This value sets the digital comparator trip high limit. When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: - TRIPHI[23:17] will be ignored in 16 bit mode - TRIPHI[23:13] will be ignored in 12 bit mode" range="23:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB1TRIPLO" acronym="ADC_CFG_ADCPPB1TRIPLO" offset="140" width="32" description="ADC PPB1 Trip Low/Trigger Time Stamp Register.">
		<bitfield id="REQSTAMP" width="12" begin="31" end="20" resetval="0x0" description="ADC Post Processing Block 1 Request Time Stamp. When a trigger sets the associated SOC flag in the ADCSOCFLG1 register the value of ADCCOUNTER.FREECOUNT is loaded into this bit field." range="31:20" rwaccess="R"/>
	<bitfield id="LIMITLO2EN" width="1" begin="19" end="19" resetval="0x0" description="Extended Low Limit 2 Enable.   0 = Low limit set by ADCPPB1TRIPLO register.  Not compatible with comparison with ADCPPB1PSUM or ADCPPB1SUM 1 = Low limit set by ADCPPB1TRIPLO2 register" range="19" rwaccess="R/W"/>
	<bitfield id="LSIGN" width="1" begin="16" end="16" resetval="0x0" description="Low Limit Sign Bit. This is the sign bit [17th bit] to the LIMITLO bit field when in 16-bit ADC mode." range="16" rwaccess="R/W"/>
	<bitfield id="LIMITLO" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block 1 Trip Low Limit. This value sets the digital comparator trip low limit. In 16-bit mode all 17 bits will be compared against the 17 bits of the PPBRESULT bit field of the ADCPPB1RESULT register. In 12-bit mode bits 12:0 will be compared against bits 12:0 of the PPBRSULT bit field of the ADCPPB1RESULT register." range="15:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB2CONFIG" acronym="ADC_CFG_ADCPPB2CONFIG" offset="144" width="16" description="ADC PPB2 Config Register.">
		<bitfield id="ABSEN" width="1" begin="6" end="6" resetval="0x0" description="ADC Post Processing Block 2 Absolute Value Enable. When set this bit enables absolute value calculation on the ADCRESULx associated with ADCPPB2. This occurs before the TWOSCOMPEN logic is evaluated [so enabling both TWOSCOMPEN and ABSEN will always result in a negative value stored in ADCPPBxRESULT]   0  ADCPPB2RESULT = ADCRESULTx - ADCPPB2OFFREF   1  ADCPPB2RESULT = abs[ADCRESULTx - ADCPPB2OFFREF]" range="6" rwaccess="R/W"/>
	<bitfield id="CBCEN" width="1" begin="5" end="5" resetval="0x0" description="ADC Post Processing Block Cycle By Cycle Enable. When set, this bit enables the post conversion hardware processing circuit to automatically clear the ADCEVTSTAT on a conversion if the event condition is no longer present." range="5" rwaccess="R/W"/>
	<bitfield id="TWOSCOMPEN" width="1" begin="4" end="4" resetval="0x0" description="ADC Post Processing Block 2 Two's Complement Enable. When set this bit enables the post conversion hardware processing circuit that performs a two's complement on the output of the offset/reference subtraction unit before storing the result in the  ADCPPB2RESULT register.   0  ADCPPB2RESULT = ADCRESULTx - ADCPPB2OFFREF   1  ADCPPB2RESULT = ADCPPB2OFFREF - ADCRESULTx" range="4" rwaccess="R/W"/>
	<bitfield id="CONFIG" width="4" begin="3" end="0" resetval="0x1" description="ADC Post Processing Block 2 Configuration. This bit field defines which SOC/EOC/RESULT is associated with this post processing block.  0000 SOC0/EOC0/RESULT0 is associated with post processing block 2  0001 SOC1/EOC1/RESULT1 is associated with post processing block 2  0010 SOC2/EOC2/RESULT2 is associated with post processing block 2  0011 SOC3/EOC3/RESULT3 is associated with post processing block 2  0100 SOC4/EOC4/RESULT4 is associated with post processing block 2  0101 SOC5/EOC5/RESULT5 is associated with post processing block 2  0110 SOC6/EOC6/RESULT6 is associated with post processing block 2  0111 SOC7/EOC7/RESULT7 is associated with post processing block 2  1000 SOC8/EOC8/RESULT8 is associated with post processing block 2  1001 SOC9/EOC9/RESULT9 is associated with post processing block 2  1010 SOC10/EOC10/RESULT10 is associated with post processing block 2  1011 SOC11/EOC11/RESULT11 is associated with post processing block 2  1100 SOC12/EOC12/RESULT12 is associated with post processing block 2  1101 SOC13/EOC13/RESULT13 is associated with post processing block 2  1110 SOC14/EOC14/RESULT14 is associated with post processing block 2  1111 SOC15/EOC15/RESULT15 is associated with post processing block 2" range="3:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB2STAMP" acronym="ADC_CFG_ADCPPB2STAMP" offset="146" width="16" description="ADC PPB2 Sample Delay Time Stamp Register.">
		<bitfield id="DLYSTAMP" width="12" begin="11" end="0" resetval="0x0" description="ADC Post Processing Block 2 Delay Time Stamp. When an SOC starts sampling the value contained in REQSTAMP is subtracted from the value in ADCCOUNTER.FREECOUNT and loaded into this bit field, thereby giving the number of system clock cycles delay between the SOC trigger and the actual start of the sample." range="11:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB2OFFCAL" acronym="ADC_CFG_ADCPPB2OFFCAL" offset="148" width="16" description="ADC PPB2 Offset Calibration Register.">
		<bitfield id="OFFCAL" width="10" begin="9" end="0" resetval="0x0" description="ADC Post Processing Block 2 Offset Correction. This bit field can be used to digitally remove any system level offset inherent in the ADCIN circuit. This 10-bit signed value is subtracted from the ADC output before being stored in the ADCRESULT register.  000h No change. The ADC output is stored directly into ADCRESULT.  001h ADC output - 1 is stored into ADCRESULT.  002h ADC output - 2 is stored into ADCRESULT.   ...  200h ADC output + 512 is stored into ADCRESULT.   ...   3FFh  ADC output + 1 is stored into ADCRESULT. NOTE: In 16-bit mode, the subtraction will saturate at0000hand FFFFh before being stored into the ADCRESULT register. In 12-bit mode, the subtraction will saturate at0000hand 0FFFh before being stored into the ADCRESULT register. Note: in the case that multiple PPBs point to the same SOC, only the OFFCAL of the lowest numbered PPB will be applied.  " range="9:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB2OFFREF" acronym="ADC_CFG_ADCPPB2OFFREF" offset="150" width="16" description="ADC PPB2 Offset Reference Register.">
		<bitfield id="OFFREF" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block 2 Offset Correction. This bit field can be used to either calculate the feedback error or convert a unipolar signal to bipolar by subtracting a reference value. This 16-bit unsigned value is subtracted from the ADCRESULT register before being passed through an optional two's complement function and stored in the ADCPPB2RESULT register. This subtraction is not saturated.  0000h No change. The ADCRESULT value is passed on.  0001h ADCRESULT - 1 is passed on.  0002h ADCRESULT - 2 is passed on.   ...  8000h ADCRESULT - 32,768 is passed on.   ...   FFFFh  ADCRESULT - 65,535 is passed on. NOTE: In 12-bit mode the size of this register does not change from 16-bits. It is the user's responsibility to ensure that only a 12-bit value is written to this register when in 12-bit mode." range="15:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB2TRIPHI" acronym="ADC_CFG_ADCPPB2TRIPHI" offset="152" width="32" description="ADC PPB2 Trip High Register.">
		<bitfield id="LIMITHI" width="24" begin="23" end="0" resetval="0x0" description="ADC Post Processing Block 2 Trip High Limit. This value sets the digital comparator trip high limit. When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: - TRIPHI[23:17] will be ignored in 16 bit mode - TRIPHI[23:13] will be ignored in 12 bit mode" range="23:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB2TRIPLO" acronym="ADC_CFG_ADCPPB2TRIPLO" offset="156" width="32" description="ADC PPB2 Trip Low/Trigger Time Stamp Register.">
		<bitfield id="REQSTAMP" width="12" begin="31" end="20" resetval="0x0" description="ADC Post Processing Block 2 Request Time Stamp. When a trigger sets the associated SOC flag in the ADCSOCFLG1 register the value of ADCCOUNTER.FREECOUNT is loaded into this bit field." range="31:20" rwaccess="R"/>
	<bitfield id="LIMITLO2EN" width="1" begin="19" end="19" resetval="0x0" description="Extended Low Limit 2 Enable.   0 = Low limit set by ADCPPB2TRIPLO register.  Not compatible with comparison with ADCPPB2PSUM or ADCPPB2SUM 1 = Low limit set by ADCPPB2TRIPLO2 register" range="19" rwaccess="R/W"/>
	<bitfield id="LSIGN" width="1" begin="16" end="16" resetval="0x0" description="Low Limit Sign Bit. This is the sign bit [17th bit] to the LIMITLO bit field when in 16-bit ADC mode." range="16" rwaccess="R/W"/>
	<bitfield id="LIMITLO" width="16" begin="15" end="0" resetval="0x0" description="ADC Post Processing Block 2 Trip Low Limit. This value sets the digital comparator trip low limit. In 16-bit mode all 17 bits will be compared against the 17 bits of the PPBRESULT bit field of the ADCPPB2RESULT register. In 12-bit mode bits 12:0 will be compared against bits 12:0 of the PPBRSULT bit field of the ADCPPB2RESULT register." range="15:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB3CONFIG" acronym="ADC_CFG_ADCPPB3CONFIG" offset="160" width="16" description="ADC PPB3 Config Register.">
		<bitfield id="ABSEN" width="1" begin="6" end="6" resetval="0x0" description="ADC Post Processing Block 3 Absolute Value Enable. When set this bit enables absolute value calculation on the ADCRESULx associated with ADCPPB3. This occurs before the TWOSCOMPEN logic is evaluated [so enabling both TWOSCOMPEN and ABSEN will always result in a negative value stored in ADCPPBxRESULT]   0  ADCPPB3RESULT = ADCRESULTx - ADCPPB3OFFREF   1  ADCPPB3RESULT = abs[ADCRESULTx - ADCPPB3OFFREF]" range="6" rwaccess="R/W"/>
	<bitfield id="CBCEN" width="1" begin="5" end="5" resetval="0x0" description="ADC Post Processing Block Cycle By Cycle Enable. When set, this bit enables the post conversion hardware processing circuit to automatically clear the ADCEVTSTAT on a conversion if the event condition is no longer present." range="5" rwaccess="R/W"/>
	<bitfield id="TWOSCOMPEN" width="1" begin="4" end="4" resetval="0x0" description="ADC Post Processing Block 3 Two's Complement Enable. When set this bit enables the post conversion hardware processing circuit that performs a two's complement on the output of the offset/reference subtraction unit before storing the result in the  ADCPPB3RESULT register.   0  ADCPPB3RESULT = ADCRESULTx - ADCPPB3OFFREF   1  ADCPPB3RESULT = ADCPPB3OFFREF - ADCRESULTx" range="4" rwaccess="R/W"/>
