ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/ADC_ADC_CFG_502C0000h.xml
	<bitfield id="SOC0CHKEN" width="2" begin="1" end="0" resetval="0x0" description="Determine which result will be passed to the safety result checker.  Only one of the raw ADC result, the PPB result, or the final PPB accumulated SUM can be passed on to the checker for each conversion.    00  No result passed to safety checker  01  ADCRESULT0 passed to safety checker  10   PPB Result associated with SOC0 passed to safety checker   11 PPB Sum associated with SOC0 passed to safety chekcer Note: if multiple PPBs point to the same SOC, the highest numbered PPB will have priority to pass its result to the safety checker " range="1:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCINTCYCLE" acronym="ADC_CFG_ADCINTCYCLE" offset="222" width="16" description="ADC Early Interrupt Generation Cycle.">
		<bitfield id="DELAY" width="16" begin="15" end="0" resetval="0x0" description="ADC Early Interrupt Generation Cycle Delay: Defines the delay from the fall edge of ADCSOC in terms of system clock cycles, for the interrupt to be generated." range="15:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCREV2" acronym="ADC_CFG_ADCREV2" offset="250" width="16" description="ADC Wrapper Revision Register.">
		<bitfield id="WRAPPERREV" width="8" begin="15" end="8" resetval="0x0" description="ADC Revision. To allow documentation of differences between revisions. First version is labeled as00h" range="15:8" rwaccess="R"/>
	<bitfield id="WRAPPERTYPE" width="8" begin="7" end="0" resetval="0x4" description="ADC Wrapper Type. Always set to 4 for this ADC." range="7:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCINLTRIMCTL" acronym="ADC_CFG_ADCINLTRIMCTL" offset="252" width="32" description="ADC Linearity Trim Control Register.">
		<bitfield id="KEY" width="16" begin="31" end="16" resetval="0x0" description="ADC Linearity Trim Control Write Key. Any write to this register must contain the value 0xA5A5 in these bit locations. If a write request attempts to load any other value into these bits, the write for the entire register is ignored. These bits always read back a zero." range="31:16" rwaccess="R/W"/>
	<bitfield id="CALIBSTEP" width="5" begin="5" end="1" resetval="0x0" description="ADC Linearity Calibration Step. Defines which of the 24 steps of calibration is to be executed. Never set this bit field while the ADC SELFTRIM is in progress. The R-M-W operation could unintentionally set the CALIBMODE bit again." range="5:1" rwaccess="R/W"/>
	<bitfield id="CALIBMODE" width="1" begin="0" end="0" resetval="0x0" description="ADC Linearity Calibration Mode." range="0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_REP1CTL" acronym="ADC_CFG_REP1CTL" offset="256" width="32" description="ADC Trigger Repeater 1 Control Register.">
		<bitfield id="SWSYNC" width="1" begin="23" end="23" resetval="0x0" description="Trigger repeater 1 software force sync.  On a sync. event, all registers in repeater 1 are reset to a ready and waiting state.  Values of NSEL, PHASE, and MODE are preserved.   Note: SOCs associated with repeater 1 are not cleared." range="23" rwaccess="R/W1TS"/>
	<bitfield id="SYNCINSEL" width="6" begin="21" end="16" resetval="0x0" description="Trigger repeater 1 sync. input select.  On a sync. event, all registers in repeater 1 are reset to a ready and waiting state.  Values of NSEL, PHASE, and MODE are preserved. Note: SOCs associated with repeater 1 are not cleared.   " range="21:16" rwaccess="R/W"/>
	<bitfield id="TRIGGER" width="7" begin="14" end="8" resetval="0x0" description="ADC Trigger Repeater 1 Trigger Select.  Selects the trigger to modify via oversampling or undersampling.  00h REPTRIG0 - Software only  01h REPTRIG1 - RTI0 Timer 02h REPTRIG2 - RTI1 Timer  03h REPTRIG3 - RTI2 Timer 04h REPTRIG4 - RTI3 Timer 05h REPTRIG5 - InputXBAR.Out[5] 06h REPTRIG6 - spare  07h REPTRIG7 - spare  08h REPTRIG8 - EPWM0, ADCSOCA  09h REPTRIG9 - EPWM0, ADCSOCB   0Ah  REPTRIG10 - EPWM1, ADCSOCA   0Bh  REPTRIG11 - EPWM1, ADCSOCB   0Ch  REPTRIG12 - EPWM2, ADCSOCA   0Dh  REPTRIG13 - EPWM2, ADCSOCB   0Eh  REPTRIG14 - EPWM3, ADCSOCA   0Fh  REPTRIG15 - EPWM3, ADCSOCB   .... EPWM4 to EPWM27 40h REPTRIG64 - EPWM28, ADCSOCA  41h REPTRIG65 - EPWM28, ADCSOCB  42h REPTRIG66 - EPWM29, ADCSOCA  43h REPTRIG67 - EPWM29, ADCSOCB  44h REPTRIG68 - EPWM30, ADCSOCA  45h REPTRIG69 - EPWM30, ADCSOCB  46h REPTRIG70 - EPWM31, ADCSOCA  47h REPTRIG71 - EPWM31, ADCSOCB  48h REPTRIG72 - ECAP0, TRIGOUT  .... ECAP1 to ECAP8  51h REPTRIG81 - ECAP9, TRIGOUT  52h REPTRIG82 - ECAP10, TRIGOUT  ....  57h REPTRIG73 - ECAP15, TRIGOUT 58h REPTRIG1  - RTI4 Timer  59h REPTRIG1  - RTI5 Timer   5Ah  REPTRIG1  - RTI6 Timer   5Bh  REPTRIG1  - RTI7 Timer  ....   7Fh - Reserved" range="14:8" rwaccess="R/W"/>
	<bitfield id="TRIGGEROVF" width="1" begin="7" end="7" resetval="0x0" description="ADC Trigger Repeater 1 Oversampled Trigger Overflow. Indicates that a trigger was dropped because a trigger arrived while the repeater was still generating repeated oversampled triggers [NCOUNT was not 0 or SOCs associated with Repeater 1 were still pending].   Writing a 1 will clear this flag. Note: This flag won't be set in undersampling mode or when NSEL = 0; if a trigger arrives before the previous SOCs have completed, the trigger will be passed and the overflow flags of the SOCs that were still pending will be set.  Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="7" rwaccess="R/W1TC"/>
	<bitfield id="PHASEOVF" width="1" begin="6" end="6" resetval="0x0" description="ADC Trigger Repeater 1 Phase Delay Overflow. Indicates that a trigger was dropped because a trigger arrived when the phase delay logic was still waiting to send the delayed trigger [PHASECOUNT was not 0].   Writing a 1 will clear this flag. Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="6" rwaccess="R/W1TC"/>
	<bitfield id="SOCBUSY" width="1" begin="4" end="4" resetval="0x0" description="ADC Trigger Repeater 1 Associated SOCs Busy indicator.  In oversampling mode: 0 = no SOCs associated with this repeater are pending 1 = SOCs associated with this repeater are still pending The next repeated trigger to the ADC in oversampling mode will not occur until SPREADCOUNT is 0 [minimum time is complete] and REP1CTL.BUSY = 0 [SOCs associated with trigger repeater 1 are no longer pending]. Note: If the ADC is in burstmode and the BURSTTRIG is Repeater 1, then all round-robin SOCs are considered associated with this repeater and the repeater will not re-trigger until there are no pending round-robin SOCs [in addition to any associated pending high-priority SOCs].  " range="4" rwaccess="R"/>
	<bitfield id="MODULEBUSY" width="1" begin="3" end="3" resetval="0x0" description="ADC Trigger Repeater 1 Module Busy indicator.  In oversampling mode: 0 = Repeater 1 is idle and can accept a new repeated trigger in oversampling mode 1 = Repeater 1 still has repeated triggers remaining [NCOUNT ' 0] or associated SOCs are still pending [SOCBUSY is 1] If a new oversampled trigger is received while the module is still busy, the TRIGGEROVF bit will be set and the trigger will be ignored. " range="3" rwaccess="R"/>
	<bitfield id="ACTIVEMODE" width="1" begin="1" end="1" resetval="0x0" description="When a trigger is recived in oversampling or undersampling mode the value of MODE is copied to ACTIVEMODE.  ACTIVEMODE determines if the repeater will repeat of filter triggers.  Changes to MODE while the repeater is working therefore won't cause any changes in functionality until the module becomes idle and then a new trigger is received.  0 = module is oversampling 1 = module is undersampling" range="1" rwaccess="R"/>
	<bitfield id="MODE" width="1" begin="0" end="0" resetval="0x0" description="ADC trigger repeater 1 mode selection.  Select either oversampling or undersampling mode.   In oversampling mode, when the trigger selected by REP1CTL.TRIGSEL is received, the repeater will repeat the trigger REP1N.NSEL + 1 times. In undersampling mode, when the trigger selected by REP1CTL.TRIGSEL is received the first time, the repeater will pass the trigger through.  The next REP1N.NSEL triggers will be ignored.   0 = oversampling 1 = undersampling" range="0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_REP1N" acronym="ADC_CFG_REP1N" offset="260" width="32" description="ADC Trigger Repeater 1 N Select Register.">
		<bitfield id="NCOUNT" width="7" begin="22" end="16" resetval="0x0" description="ADC trigger repeater 1 trigger count.   In oversampling mode, indicates the number of triggers remaining to be generated.  If a trigger is received corresponding to REP1CTL.TRIGSEL while NCOUNT is not 0 [the repeater is still busy generating the repeated triggers] then the trigger will be ignored and REP1CTL.TRIGOVF will be set to 1.        In undersampling mode, indicates the number of triggers remaining to be supressed.  " range="22:16" rwaccess="R"/>
	<bitfield id="NSEL" width="7" begin="6" end="0" resetval="0x0" description="ADC Trigger Repeater 1 selection of number of triggers. In oversampling mode, selects the number of repeated triggers. For each trigger received corresponding to REP1CTL.TRIGSEL, NSEL + 1 triggers will be generated.   0 = 1 trigger is generated [pass-through] 1 = 2 triggers are generated 2 = 3 triggers are generated ... 127 = 128 triggers are generated  In undersampling mode, selects the number triggers to be supressed. 1 out NSEL + 1 triggers received corresponding to REP1CTL.TRIGSEL will be passed through [the first trigger will be passed through and the subsequent NSEL triggers will be supressed].   0 = all triggers are passed 1 = 1 out of 2 triggers are passed 2 = 1 out of 3 triggers are passed ... 127 = 1 out of 128 triggers are passed" range="6:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_REP1PHASE" acronym="ADC_CFG_REP1PHASE" offset="264" width="32" description="ADC Trigger Repeater 1 Phase Select Register.">
		<bitfield id="PHASECOUNT" width="16" begin="31" end="16" resetval="0x0" description="ADC trigger repeater 1 phase delay status.  When the trigger selected by REP1CTL.TRIGSEL is received, this register will start counting down from PHASECOUNT until the counter reaches 0, at which point the trigger will be passed on to the repeater re-trigger logic.  If the trigger selected by REP1CTL.TRIGSEL is recieved when PHASECOUNT is not 0 [the phase delay logic is busy from the previous trigger] then the new trigger will be ignored and REP1CTL.PHASEOVF will be set to 1.       " range="31:16" rwaccess="R"/>
	<bitfield id="PHASE" width="16" begin="15" end="0" resetval="0x0" description="ADC trigger repeater 1 phase delay configuration.  Defines the number of SYSCLKs to delay the selected trigger before passing it on to the re-triggering logic.   0 = trigger is passed through without delay 1 = trigger is delayed by 1 SYSCLK 2 = trigger is delayed by 2 SYSCLKs ... 65535 = trigger is delayed by 65535 SYSCLKs" range="15:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_REP1SPREAD" acronym="ADC_CFG_REP1SPREAD" offset="268" width="32" description="ADC Trigger Repeater 1 Spread Select Register.">
		<bitfield id="SPREADCOUNT" width="16" begin="31" end="16" resetval="0x0" description="ADC trigger repeater 1 spread status.  When a trigger is sent to the ADC in oversampling mode, this register will start counting down from SPREAD until SPREADCOUNT equals 0.   The next repeated trigger to the ADC in oversampling mode will not occur until SPREADCOUNT is 0 [minimum time is complete] and REP1CTL.BUSY = 0 [SOCs associated with trigger repeater 1 are no longer pending].  " range="31:16" rwaccess="R"/>
	<bitfield id="SPREAD" width="16" begin="15" end="0" resetval="0x0" description="ADC trigger repeater 1 spread delay configuration.  In oversampling mode, defines the minimum number of SYSCLKs to wait before creating the next repeated trigger to the ADC.   If SPREAD is less than the time needed for all SOCs associated with repeater 1 to sample and convert, then the repeater will generate triggers as fast as the ADC can convert the associated conversions. If SPREAD is greater than the time needed for all SOCs associated with repeater 1 to sample and convert, then repeated triggers to the ADC will be SPREAD SYSCLK cycles apart.   0 = oversampled repeated triggers occur as fast as the ADC can sample and convert associated SOCs 1 = time between repeated triggers is at least 1 SYSCLKs 2 = time between repeated triggers is at least 2 SYSCLKs ... 65535 =  time between repeated triggers is at least 65535 SYSCLKs" range="15:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_REP1FRC" acronym="ADC_CFG_REP1FRC" offset="272" width="16" description="ADC Trigger Repeater 1 Software Force Register.">
		<bitfield id="SWFRC" width="1" begin="0" end="0" resetval="0x0" description="Write 1 to force a trigger to repeat block 1 input regardless of the value of TRIGGER. Always reads 0. " range="0" rwaccess="R/W1TS"/>
	</register><register id="ADC_CFG_REP2CTL" acronym="ADC_CFG_REP2CTL" offset="288" width="32" description="ADC Trigger Repeater 2 Control Register.">
		<bitfield id="SWSYNC" width="1" begin="23" end="23" resetval="0x0" description="Trigger repeater 2 software force sync.  On a sync. event, all registers in repeater 2 are reset to a ready and waiting state.  Values of NSEL, PHASE, and MODE are preserved.   Note: SOCs associated with repeater 2 are not cleared." range="23" rwaccess="R/W1TS"/>
	<bitfield id="SYNCINSEL" width="6" begin="21" end="16" resetval="0x0" description="Trigger repeater 2 sync. input select.  On a sync. event, all registers in repeater 2 are reset to a ready and waiting state.  Values of NSEL, PHASE, and MODE are preserved. Note: SOCs associated with repeater 2 are not cleared.   " range="21:16" rwaccess="R/W"/>
	<bitfield id="TRIGGER" width="7" begin="14" end="8" resetval="0x0" description="ADC Trigger Repeater 2 Trigger Select.  Selects the trigger to modify via oversampling or undersampling.  00h REPTRIG0 - Software only  01h REPTRIG1 - RTI0 Timer 02h REPTRIG2 - RTI1 Timer  03h REPTRIG3 - RTI2 Timer 04h REPTRIG4 - RTI3 Timer 05h REPTRIG5 - InputXBAR.Out[5] 06h REPTRIG6 - spare  07h REPTRIG7 - spare  08h REPTRIG8 - EPWM0, ADCSOCA  09h REPTRIG9 - EPWM0, ADCSOCB   0Ah  REPTRIG10 - EPWM1, ADCSOCA   0Bh  REPTRIG11 - EPWM1, ADCSOCB   0Ch  REPTRIG12 - EPWM2, ADCSOCA   0Dh  REPTRIG13 - EPWM2, ADCSOCB   0Eh  REPTRIG14 - EPWM3, ADCSOCA   0Fh  REPTRIG15 - EPWM3, ADCSOCB   .... EPWM4 to EPWM27 40h REPTRIG64 - EPWM28, ADCSOCA  41h REPTRIG65 - EPWM28, ADCSOCB  42h REPTRIG66 - EPWM29, ADCSOCA  43h REPTRIG67 - EPWM29, ADCSOCB  44h REPTRIG68 - EPWM30, ADCSOCA  45h REPTRIG69 - EPWM30, ADCSOCB  46h REPTRIG70 - EPWM31, ADCSOCA  47h REPTRIG71 - EPWM31, ADCSOCB  48h REPTRIG72 - ECAP0, TRIGOUT  .... ECAP1 to ECAP8  51h REPTRIG81 - ECAP9, TRIGOUT  52h REPTRIG82 - ECAP10, TRIGOUT  ....  57h REPTRIG73 - ECAP15, TRIGOUT 58h REPTRIG1  - RTI4 Timer  59h REPTRIG1  - RTI5 Timer   5Ah  REPTRIG1  - RTI6 Timer   5Bh  REPTRIG1  - RTI7 Timer  .... 64h- 7Fh - Reserved" range="14:8" rwaccess="R/W"/>
	<bitfield id="TRIGGEROVF" width="1" begin="7" end="7" resetval="0x0" description="ADC Trigger Repeater 2 Oversampled Trigger Overflow. Indicates that a trigger was dropped because a trigger arrived while the repeater was still generating repeated oversampled triggers [NCOUNT was not 0 or SOCs associated with Repeater 2 were still pending].   Writing a 1 will clear this flag. Note: This flag won't be set in undersampling mode or when NSEL = 0; if a trigger arrives before the previous SOCs have completed, the trigger will be passed and the overflow flags of the SOCs that were still pending will be set.  Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="7" rwaccess="R/W1TC"/>
	<bitfield id="PHASEOVF" width="1" begin="6" end="6" resetval="0x0" description="ADC Trigger Repeater 2 Phase Delay Overflow. Indicates that a trigger was dropped because a trigger arrived when the phase delay logic was still waiting to send the delayed trigger [PHASECOUNT was not 0].   Writing a 1 will clear this flag. Note: If software sets the clear bit on the same cycle that hardware is trying to set the flag bit, then hardware has priority and the overflow bit will not be set" range="6" rwaccess="R/W1TC"/>
	<bitfield id="SOCBUSY" width="1" begin="4" end="4" resetval="0x0" description="ADC Trigger Repeater 2 Associated SOCs Busy indicator.  In oversampling mode: 0 = no SOCs associated with this repeater are pending 1 = SOCs associated with this repeater are still pending The next repeated trigger to the ADC in oversampling mode will not occur until SPREADCOUNT is 0 [minimum time is complete] and REP2CTL.BUSY = 0 [SOCs associated with trigger repeater 2 are no longer pending]. Note: If the ADC is in burstmode and the BURSTTRIG is Repeater 2, then all round-robin SOCs are considered associated with this repeater and the repeater will not re-trigger until there are no pending round-robin SOCs [in addition to any associated pending high-priority SOCs].  " range="4" rwaccess="R"/>
	<bitfield id="MODULEBUSY" width="1" begin="3" end="3" resetval="0x0" description="ADC Trigger Repeater 2 Module Busy indicator.  In oversampling mode: 0 = Repeater 2 is idle and can accept a new repeated trigger in oversampling mode 1 = Repeater 2 still has repeated triggers remaining [NCOUNT ' 0] or associated SOCs are still pending [SOCBUSY is 1] If a new oversampled trigger is received while the module is still busy, the TRIGGEROVF bit will be set and the trigger will be ignored. " range="3" rwaccess="R"/>
	<bitfield id="ACTIVEMODE" width="1" begin="1" end="1" resetval="0x0" description="When a trigger is recived in oversampling or undersampling mode the value of MODE is copied to ACTIVEMODE.  ACTIVEMODE determines if the repeater will repeat of filter triggers.  Changes to MODE while the repeater is working therefore won't cause any changes in functionality until the module becomes idle and then a new trigger is received.  0 = module is oversampling 1 = module is undersampling" range="1" rwaccess="R"/>
	<bitfield id="MODE" width="1" begin="0" end="0" resetval="0x0" description="ADC trigger repeater 2 mode selection.  Select either oversampling or undersampling mode.   In oversampling mode, when the trigger selected by REP2CTL.TRIGSEL is received, the repeater will repeat the trigger REP2N.NSEL + 1 times. In undersampling mode, when the trigger selected by REP2CTL.TRIGSEL is received the first time, the repeater will pass the trigger through.  The next REP2N.NSEL triggers will be ignored.   0 = oversampling 1 = undersampling" range="0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_REP2N" acronym="ADC_CFG_REP2N" offset="292" width="32" description="ADC Trigger Repeater 2 N Select Register.">
		<bitfield id="NCOUNT" width="7" begin="22" end="16" resetval="0x0" description="ADC trigger repeater 2 trigger count.   In oversampling mode, indicates the number of triggers remaining to be generated.  If a trigger is received corresponding to REP2CTL.TRIGSEL while NCOUNT is not 0 [the repeater is still busy generating the repeated triggers] then the trigger will be ignored and REP2CTL.TRIGOVF will be set to 1.        In undersampling mode, indicates the number of triggers remaining to be supressed.  " range="22:16" rwaccess="R"/>
	<bitfield id="NSEL" width="7" begin="6" end="0" resetval="0x0" description="ADC Trigger Repeater 2 selection of number of triggers. In oversampling mode, selects the number of repeated triggers. For each trigger received corresponding to REP2CTL.TRIGSEL, NSEL + 1 triggers will be generated.   0 = 1 trigger is generated [pass-through] 1 = 2 triggers are generated 2 = 3 triggers are generated ... 127 = 128 triggers are generated  In undersampling mode, selects the number triggers to be supressed. 1 out NSEL + 1 triggers received corresponding to REP2CTL.TRIGSEL will be passed through [the first trigger will be passed through and the subsequent NSEL triggers will be supressed].   0 = all triggers are passed 1 = 1 out of 2 triggers are passed 2 = 1 out of 3 triggers are passed ... 127 = 1 out of 128 triggers are passed" range="6:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_REP2PHASE" acronym="ADC_CFG_REP2PHASE" offset="296" width="32" description="ADC Trigger Repeater 2 Phase Select Register.">
		<bitfield id="PHASECOUNT" width="16" begin="31" end="16" resetval="0x0" description="ADC trigger repeater 2 phase delay status.  When the trigger selected by REP2CTL.TRIGSEL is received, this register will start counting down from PHASECOUNT until the counter reaches 0, at which point the trigger will be passed on to the repeater re-trigger logic.  If the trigger selected by REP2CTL.TRIGSEL is recieved when PHASECOUNT is not 0 [the phase delay logic is busy from the previous trigger] then the new trigger will be ignored and REP2CTL.PHASEOVF will be set to 1.       " range="31:16" rwaccess="R"/>
	<bitfield id="PHASE" width="16" begin="15" end="0" resetval="0x0" description="ADC trigger repeater 2 phase delay configuration.  Defines the number of SYSCLKs to delay the selected trigger before passing it on to the re-triggering logic.   0 = trigger is passed through without delay 1 = trigger is delayed by 1 SYSCLK 2 = trigger is delayed by 2 SYSCLKs ... 65535 = trigger is delayed by 65535 SYSCLKs" range="15:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_REP2SPREAD" acronym="ADC_CFG_REP2SPREAD" offset="300" width="32" description="ADC Trigger Repeater 2 Spread Select Register.">
		<bitfield id="SPREADCOUNT" width="16" begin="31" end="16" resetval="0x0" description="ADC trigger repeater 2 spread status.  When a trigger is sent to the ADC in oversampling mode, this register will start counting down from SPREAD until SPREADCOUNT equals 0.   The next repeated trigger to the ADC in oversampling mode will not occur until SPREADCOUNT is 0 [minimum time is complete] and REP2CTL.BUSY = 0 [SOCs associated with trigger repeater 2 are no longer pending].  " range="31:16" rwaccess="R"/>
	<bitfield id="SPREAD" width="16" begin="15" end="0" resetval="0x0" description="ADC trigger repeater 2 spread delay configuration.  In oversampling mode, defines the minimum number of SYSCLKs to wait before creating the next repeated trigger to the ADC.   If SPREAD is less than the time needed for all SOCs associated with repeater 2 to sample and convert, then the repeater will generate triggers as fast as the ADC can convert the associated conversions. If SPREAD is greater than the time needed for all SOCs associated with repeater 2 to sample and convert, then repeated triggers to the ADC will be SPREAD SYSCLK cycles apart.   0 = oversampled repeated triggers occur as fast as the ADC can sample and convert associated SOCs 1 = time between repeated triggers is at least 1 SYSCLKs 2 = time between repeated triggers is at least 2 SYSCLKs ... 65535 =  time between repeated triggers is at least 65535 SYSCLKs" range="15:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_REP2FRC" acronym="ADC_CFG_REP2FRC" offset="304" width="16" description="ADC Trigger Repeater 2 Software Force Register.">
		<bitfield id="SWFRC" width="1" begin="0" end="0" resetval="0x0" description="Write 1 to force a trigger to repeat block 2 input regardless of the value of TRIGGER. Always reads 0. " range="0" rwaccess="R/W1TS"/>
	</register><register id="ADC_CFG_ADCPPB1LIMIT" acronym="ADC_CFG_ADCPPB1LIMIT" offset="320" width="16" description="ADC PPB1Conversion Count Limit Register.">
