ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/ADC_ADC_CFG_502C0000h.xml
		<bitfield id="LIMIT" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 1 Oversampling Limit.  Defines the number of conversions to accumulate before PSUM is automatically loaded into SUM.   To prevent PSUM from overflowing, do not write a value larger than 128 when the ADC is operating in 16-bit mode.  " range="9:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPBP1PCOUNT" acronym="ADC_CFG_ADCPPBP1PCOUNT" offset="324" width="16" description="ADC PPB1 Partial Conversion Count Register.">
		<bitfield id="PCOUNT" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 1 Oversampling Partial Count.  Each time a new result propagates through the PPB signal chain and accumulates into ADCPPB1PSUM this register is incremented by 1.    This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB1 receives a sync. event.  This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB1RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB1CONFIG2" acronym="ADC_CFG_ADCPPB1CONFIG2" offset="328" width="16" description="ADC PPB1 Sum Shift Register.">
		<bitfield id="COMPSEL" width="2" begin="15" end="14" resetval="0x0" description="Post Processing Block 1 Compare Source Select.  This field determines whether ADCPPB1RESULT, ADCPPB1PSUM, or ADCPPB1SUM is used for the zero-crossing detect logic and threshold compare. 00 = ADCPPB1RESULT is used for compare logic 01 = ADCPPB1PSUM is used for compare logic 10 = ADCPPB1SUM is used for compare logic 11 = Reserved Note: when ADCPPB1PSUM is selected as the compare source and when a LIMIT match occurs [ADCPPB1LIMIT equals ADCPPB1COUNT] the ADCPPB1PSUM register will be cleared and the final sum will be loaded into ADCPPB1SUM.  For this sample, the final sum, ADCPPB1SUM will be used for the compariosn instead of ADCPPB1PSUM. " range="15:14" rwaccess="R/W"/>
	<bitfield id="OSINTSEL" width="1" begin="12" end="12" resetval="0x0" description="Post Processing Block 1 Interrupt Source Select.  OSINT1 can be used to trigger an ADC interrupt [ADCINT1 through ADCINT4] via selection in the ADCINT1N2 or ADCINT3N4.  This selection determines if a sync. event can trigger OSINT1 in addition to a PCOUNT = LIMIT event.        0 = OSINT1 will be generated from PCOUNT = LIMIT only 1 = OSTIN1 will be generated form PCOUNT = LIMIT or a sync. event.   Note: If a SYNC event would cause an OSINT one cycle after OSINT would have been cause by PCOUNT = LIMIT match, then the second OSINT is ignored. " range="12" rwaccess="R/W"/>
	<bitfield id="SWSYNC" width="1" begin="11" end="11" resetval="0x0" description="PPB 1 software force sync.  On a sync. event, all partial registers transfer to the final registers and are then reset.  Note: In the case where the software force occurs at the same time that a new sample is added to the PSUM and the PSUM is being used for a high or low limit compare, then the comparison will not occur.   " range="11" rwaccess="R/W1TS"/>
	<bitfield id="SYNCINSEL" width="6" begin="9" end="4" resetval="0x0" description="PPB 1 sync. input select.  On a sync. event, all partial registers transfer to the final registers and are then reset.   Refer to SOC spec for details" range="9:4" rwaccess="R/W"/>
	<bitfield id="SHIFT" width="4" begin="3" end="0" resetval="0x0" description="Post Processing Block 1 right shift.  Defines the number of bits to right shift PSUM before loading into the final SUM.   0 : no right shift 1 : SUM = PSUM '' 1 2 : SUM = PSUM '' 2 ... 10 : SUM = PSUM '' 10 11 -15 : Reserved" range="3:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB1PSUM" acronym="ADC_CFG_ADCPPB1PSUM" offset="332" width="32" description="ADC PPB1 Partial Sum Register.">
		<bitfield id="SIGN" width="8" begin="31" end="24" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 23." range="31:24" rwaccess="R"/>
	<bitfield id="PSUM" width="24" begin="23" end="0" resetval="0x0" description="Post Processing Block 1 Oversampling Partial Sum.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB1RESULT the result is subsequently accumulated into this register.   This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB1 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available.  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 2 SYSCLK cycle after the associated ADCRESULT and subsequent results [in order from lowest numbered PPB to highest] will each become available every 2-3 SYSCLK cycles [refer to the TRM for detailed timing information]. " range="23:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB1PMAX" acronym="ADC_CFG_ADCPPB1PMAX" offset="336" width="32" description="ADC PPB1 Partial Max Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="PMAX" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 1 Oversampling Partial Max.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB1RESULT the result replaces this register if it is larger.   This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB1 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB1RESULT timing information]. " range="16:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB1PMAXI" acronym="ADC_CFG_ADCPPB1PMAXI" offset="340" width="16" description="ADC PPB1 Partial Max Index Register.">
		<bitfield id="PMAXI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 1 Oversampling Partial Index of Max.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB1RESULT if the result replaces PMAX this register is loaded with the current value of PCOUNT.  This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB1 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB1RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB1PMIN" acronym="ADC_CFG_ADCPPB1PMIN" offset="344" width="32" description="ADC PPB1 Partial MIN Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="PMIN" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 1 Oversampling Partial Min.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB1RESULT the result replaces this register if it is smaller.   This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB1 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB1RESULT timing information]. " range="16:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB1PMINI" acronym="ADC_CFG_ADCPPB1PMINI" offset="348" width="16" description="ADC PPB1 Partial Min Index Register.">
		<bitfield id="PMINI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 1 Oversampling Partial Index of Min.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB1RESULT if the result replaces PMIN this register is loaded with the current value of PCOUNT.  This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB1 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB1RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB1RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB1TRIPLO2" acronym="ADC_CFG_ADCPPB1TRIPLO2" offset="352" width="32" description="ADC PPB1 Extended Trip Low Register.">
		<bitfield id="LIMITLO" width="24" begin="23" end="0" resetval="0x0" description="ADC Post Processing Block 1 Trip High Low Limit. This value sets the digital comparator trip low limit if ADCPPB1TRIPLO.LIMITLO2EN = 1.  When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: - TRIPLO2[23:17] will be ignored in 16 bit mode - TRIPLO2[23:13] will be ignored in 12 bit mode" range="23:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB2LIMIT" acronym="ADC_CFG_ADCPPB2LIMIT" offset="372" width="16" description="ADC PPB2Conversion Count Limit Register.">
		<bitfield id="LIMIT" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 2 Oversampling Limit.  Defines the number of conversions to accumulate before PSUM is automatically loaded into SUM.   To prevent PSUM from overflowing, do not write a value larger than 128 when the ADC is operating in 16-bit mode.  " range="9:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPBP2PCOUNT" acronym="ADC_CFG_ADCPPBP2PCOUNT" offset="376" width="16" description="ADC PPB2 Partial Conversion Count Register.">
		<bitfield id="PCOUNT" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 2 Oversampling Partial Count.  Each time a new result propagates through the PPB signal chain and accumulates into ADCPPB2PSUM this register is incremented by 1.   This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB2 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB2RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB2CONFIG2" acronym="ADC_CFG_ADCPPB2CONFIG2" offset="380" width="16" description="ADC PPB2 Sum Shift Register.">
		<bitfield id="COMPSEL" width="2" begin="15" end="14" resetval="0x0" description="Post Processing Block 2 Compare Source Select.  This field determines whether ADCPPB2RESULT, ADCPPB2PSUM, or ADCPPB2SUM is used for the zero-crossing detect logic and threshold compare. 00 = ADCPPB2RESULT is used for compare logic 01 = ADCPPB2PSUM is used for compare logic 10 = ADCPPB2SUM is used for compare logic 11 = Reserved Note: when ADCPPB2PSUM is selected as the compare source and when a LIMIT match occurs [ADCPPB2LIMIT equals ADCPPB2COUNT] the ADCPPB2PSUM register will be cleared and the final sum will be loaded into ADCPPB2SUM.  For this sample, the final sum, ADCPPB2SUM will be used for the compariosn instead of ADCPPB2PSUM. " range="15:14" rwaccess="R/W"/>
	<bitfield id="OSINTSEL" width="1" begin="12" end="12" resetval="0x0" description="Post Processing Block 2 Interrupt Source Select.  OSINT2 can be used to trigger an ADC interrupt [ADCINT1 through ADCINT4] via selection in the ADCINT1N2 or ADCINT3N4.  This selection determines if a sync. event can trigger OSINT2 in addition to a PCOUNT = LIMIT event.        0 = OSINT2 will be generated from PCOUNT = LIMIT only 1 = OSTIN2 will be generated form PCOUNT = LIMIT or a sync. event.   Note: If a SYNC event would cause an OSINT one cycle after OSINT would have been cause by PCOUNT = LIMIT match, then the second OSINT is ignored. " range="12" rwaccess="R/W"/>
	<bitfield id="SWSYNC" width="1" begin="11" end="11" resetval="0x0" description="PPB 2 software force sync.  On a sync. event, all partial registers transfer to the final registers and are then reset.  Note: In the case where the software force occurs at the same time that a new sample is added to the PSUM and the PSUM is being used for a high or low limit compare, then the comparison will not occur.   " range="11" rwaccess="R/W1TS"/>
	<bitfield id="SYNCINSEL" width="6" begin="9" end="4" resetval="0x0" description="PPB 2 sync. input select.  On a sync. event, all partial registers transfer to the final registers and are then reset.   Refer to SOC spec for details" range="9:4" rwaccess="R/W"/>
	<bitfield id="SHIFT" width="4" begin="3" end="0" resetval="0x0" description="Post Processing Block 2 right shift.  Defines the number of bits to right shift PSUM before loading into the final SUM.   0 : no right shift 1 : SUM = PSUM '' 1 2 : SUM = PSUM '' 2 ... 10 : SUM = PSUM '' 10 11 -15 : Reserved" range="3:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB2PSUM" acronym="ADC_CFG_ADCPPB2PSUM" offset="384" width="32" description="ADC PPB2 Partial Sum Register.">
		<bitfield id="SIGN" width="8" begin="31" end="24" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 23." range="31:24" rwaccess="R"/>
	<bitfield id="PSUM" width="24" begin="23" end="0" resetval="0x0" description="Post Processing Block 2 Oversampling Partial Sum.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB2RESULT the result is subsequently accumulated into this register.   This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB2 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available.  This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC.  In the case of multiple PPBs associated with the same SOC, the lowest numbered PPB's result will be availble 2 SYSCLK cycle after the associated ADCRESULT and subsequent results [in order from lowest numbered PPB to highest] will each become available every 2-3 SYSCLK cycles [refer to the TRM for detailed timing information]. " range="23:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB2PMAX" acronym="ADC_CFG_ADCPPB2PMAX" offset="388" width="32" description="ADC PPB2 Partial Max Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="PMAX" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 2 Oversampling Partial Max.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB2RESULT the result replaces this register if it is larger.   This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB2 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB2RESULT timing information]. " range="16:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB2PMAXI" acronym="ADC_CFG_ADCPPB2PMAXI" offset="392" width="16" description="ADC PPB2 Partial Max Index Register.">
		<bitfield id="PMAXI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 2 Oversampling Partial Index of Max.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB2RESULT if the result replaces PMAX this register is loaded with the current value of PCOUNT.  This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB2 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB2RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB2PMIN" acronym="ADC_CFG_ADCPPB2PMIN" offset="396" width="32" description="ADC PPB2 Partial MIN Register.">
		<bitfield id="SIGN" width="15" begin="31" end="17" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 16." range="31:17" rwaccess="R"/>
	<bitfield id="PMIN" width="17" begin="16" end="0" resetval="0x0" description="Post Processing Block 2 Oversampling Partial Min.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB2RESULT the result replaces this register if it is smaller.   This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB2 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB2RESULT timing information]. " range="16:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB2PMINI" acronym="ADC_CFG_ADCPPB2PMINI" offset="400" width="16" description="ADC PPB2 Partial Min Index Register.">
		<bitfield id="PMINI" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 2 Oversampling Partial Index of Min.  Each time a new result propagates through the PPB signal chain and latches into ADCPPB2RESULT if the result replaces PMIN this register is loaded with the current value of PCOUNT.  This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB2 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB2RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB2RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB2TRIPLO2" acronym="ADC_CFG_ADCPPB2TRIPLO2" offset="404" width="32" description="ADC PPB2 Extended Trip Low Register.">
		<bitfield id="LIMITLO" width="24" begin="23" end="0" resetval="0x0" description="ADC Post Processing Block 2 Trip High Low Limit. This value sets the digital comparator trip low limit if ADCPPB2TRIPLO.LIMITLO2EN = 1.  When comparing to an ADCPPBxRESULT register, the upper bits will be ignored: - TRIPLO2[23:17] will be ignored in 16 bit mode - TRIPLO2[23:13] will be ignored in 12 bit mode" range="23:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB3LIMIT" acronym="ADC_CFG_ADCPPB3LIMIT" offset="424" width="16" description="ADC PPB3Conversion Count Limit Register.">
		<bitfield id="LIMIT" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 3 Oversampling Limit.  Defines the number of conversions to accumulate before PSUM is automatically loaded into SUM.   To prevent PSUM from overflowing, do not write a value larger than 128 when the ADC is operating in 16-bit mode.  " range="9:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPBP3PCOUNT" acronym="ADC_CFG_ADCPPBP3PCOUNT" offset="428" width="16" description="ADC PPB3 Partial Conversion Count Register.">
		<bitfield id="PCOUNT" width="10" begin="9" end="0" resetval="0x0" description="Post Processing Block 3 Oversampling Partial Count.  Each time a new result propagates through the PPB signal chain and accumulates into ADCPPB3PSUM this register is incremented by 1.   This register is reset when either a count-match event occurs [PCOUNT = LIMIT] or PPB3 receives a sync. event. This result is available 1 SYSCLK cycle after the associated ADCPPB3RESULT is available. This will be 2 SYSCLK cycles after the associated ADCRESULT is available, unless multiple PPBs point to the same SOC [refer to the ADCPPB3RESULT timing information]. " range="9:0" rwaccess="R"/>
	</register><register id="ADC_CFG_ADCPPB3CONFIG2" acronym="ADC_CFG_ADCPPB3CONFIG2" offset="432" width="16" description="ADC PPB3 Sum Shift Register.">
		<bitfield id="COMPSEL" width="2" begin="15" end="14" resetval="0x0" description="Post Processing Block 3 Compare Source Select.  This field determines whether ADCPPB3RESULT, ADCPPB3PSUM, or ADCPPB3SUM is used for the zero-crossing detect logic and threshold compare. 00 = ADCPPB3RESULT is used for compare logic 01 = ADCPPB3PSUM is used for compare logic 10 = ADCPPB3SUM is used for compare logic 11 = Reserved Note: when ADCPPB3PSUM is selected as the compare source and when a LIMIT match occurs [ADCPPB3LIMIT equals ADCPPB3COUNT] the ADCPPB3PSUM register will be cleared and the final sum will be loaded into ADCPPB3SUM.  For this sample, the final sum, ADCPPB3SUM will be used for the compariosn instead of ADCPPB3PSUM. " range="15:14" rwaccess="R/W"/>
	<bitfield id="OSINTSEL" width="1" begin="12" end="12" resetval="0x0" description="Post Processing Block 3 Interrupt Source Select.  OSINT3 can be used to trigger an ADC interrupt [ADCINT1 through ADCINT4] via selection in the ADCINT1N2 or ADCINT3N4.  This selection determines if a sync. event can trigger OSINT3 in addition to a PCOUNT = LIMIT event.        0 = OSINT3 will be generated from PCOUNT = LIMIT only 1 = OSTIN3 will be generated form PCOUNT = LIMIT or a sync. event.   Note: If a SYNC event would cause an OSINT one cycle after OSINT would have been cause by PCOUNT = LIMIT match, then the second OSINT is ignored. " range="12" rwaccess="R/W"/>
	<bitfield id="SWSYNC" width="1" begin="11" end="11" resetval="0x0" description="PPB 3 software force sync.  On a sync. event, all partial registers transfer to the final registers and are then reset.  Note: In the case where the software force occurs at the same time that a new sample is added to the PSUM and the PSUM is being used for a high or low limit compare, then the comparison will not occur.   " range="11" rwaccess="R/W1TS"/>
	<bitfield id="SYNCINSEL" width="6" begin="9" end="4" resetval="0x0" description="PPB 3 sync. input select.  On a sync. event, all partial registers transfer to the final registers and are then reset.   Refer to SOC spec for details" range="9:4" rwaccess="R/W"/>
	<bitfield id="SHIFT" width="4" begin="3" end="0" resetval="0x0" description="Post Processing Block 3 right shift.  Defines the number of bits to right shift PSUM before loading into the final SUM.   0 : no right shift 1 : SUM = PSUM '' 1 2 : SUM = PSUM '' 2 ... 10 : SUM = PSUM '' 10 11 -15 : Reserved" range="3:0" rwaccess="R/W"/>
	</register><register id="ADC_CFG_ADCPPB3PSUM" acronym="ADC_CFG_ADCPPB3PSUM" offset="436" width="32" description="ADC PPB3 Partial Sum Register.">
		<bitfield id="SIGN" width="8" begin="31" end="24" resetval="0x0" description="Sign Extended Bits. These bits reflect the same value as bit 23." range="31:24" rwaccess="R"/>
